'use strict';

//Проміси - обіцянка(полегшує роботу з асинхронними операціями)

console.log('Запит даних...');

//Створюємо проміси(в середену потрібно помістити колбак функцію)
/*Аргументи в промісі означають функіїї
    resolve - щось виконалось правильно, так як очікували
    reject - не виконалось
*/
const req = new Promise(function(resolve, reject) {

    setTimeout(() => {
        console.log('Підготовка даних...');
    
        const product = {
            name: 'TV',
            price: 2000
        };
    
        resolve();
    }, 5000);

}); 

//цей метод виконується на промісі у випадку позитивного результату, then замінить функцію resolve
req.then(() => {
    console.log('Дані отримані');
}); 


